{
  "auto_mapping": {
    "base_model_class": "ChronosBoltFiDModel",
    "parent_library": "model_raf"
  },
  "base_model_name_or_path": "amazon/chronos-bolt-tiny",
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "feedforward_modules": [
    "wo"
  ],
  "inference_mode": true,
  "init_ia3_weights": true,
  "modules_to_save": null,
  "peft_type": "IA3",
  "peft_version": "0.18.1",
  "revision": null,
  "target_modules": [
    "k",
    "v",
    "wo"
  ],
  "task_type": null
}