{
  "alora_invocation_tokens": null,
  "alpha_pattern": {},
  "arrow_config": null,
  "auto_mapping": {
    "base_model_class": "ChronosBoltFiDModel",
    "parent_library": "model_raf"
  },
  "base_model_name_or_path": "amazon/chronos-bolt-tiny",
  "beta1": 0.85,
  "beta2": 0.85,
  "bias": "none",
  "corda_config": null,
  "deltaT": 10,
  "ensure_weight_tying": false,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "init_r": 12,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_bias": false,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "orth_reg_weight": 0.5,
  "peft_type": "ADALORA",
  "peft_version": "0.18.1",
  "qalora_group_size": 16,
  "r": 8,
  "rank_pattern": {
    "decoder.block.0.layer.0.SelfAttention.k.lora_E": [
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false
    ],
    "decoder.block.0.layer.0.SelfAttention.o.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "decoder.block.0.layer.0.SelfAttention.q.lora_E": [
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false
    ],
    "decoder.block.0.layer.0.SelfAttention.v.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "decoder.block.0.layer.1.EncDecAttention.k.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "decoder.block.0.layer.1.EncDecAttention.o.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "decoder.block.0.layer.1.EncDecAttention.q.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "decoder.block.0.layer.1.EncDecAttention.v.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "decoder.block.0.layer.2.DenseReluDense.wi.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "decoder.block.0.layer.2.DenseReluDense.wo.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "decoder.block.1.layer.0.SelfAttention.k.lora_E": [
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false
    ],
    "decoder.block.1.layer.0.SelfAttention.o.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "decoder.block.1.layer.0.SelfAttention.q.lora_E": [
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false
    ],
    "decoder.block.1.layer.0.SelfAttention.v.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "decoder.block.1.layer.1.EncDecAttention.k.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "decoder.block.1.layer.1.EncDecAttention.o.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "decoder.block.1.layer.1.EncDecAttention.q.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "decoder.block.1.layer.1.EncDecAttention.v.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "decoder.block.1.layer.2.DenseReluDense.wi.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "decoder.block.1.layer.2.DenseReluDense.wo.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "decoder.block.2.layer.0.SelfAttention.k.lora_E": [
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false
    ],
    "decoder.block.2.layer.0.SelfAttention.o.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "decoder.block.2.layer.0.SelfAttention.q.lora_E": [
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false
    ],
    "decoder.block.2.layer.0.SelfAttention.v.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "decoder.block.2.layer.1.EncDecAttention.k.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "decoder.block.2.layer.1.EncDecAttention.o.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "decoder.block.2.layer.1.EncDecAttention.q.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "decoder.block.2.layer.1.EncDecAttention.v.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "decoder.block.2.layer.2.DenseReluDense.wi.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "decoder.block.2.layer.2.DenseReluDense.wo.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "decoder.block.3.layer.0.SelfAttention.k.lora_E": [
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false
    ],
    "decoder.block.3.layer.0.SelfAttention.o.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "decoder.block.3.layer.0.SelfAttention.q.lora_E": [
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false
    ],
    "decoder.block.3.layer.0.SelfAttention.v.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "decoder.block.3.layer.1.EncDecAttention.k.lora_E": [
      true,
      true,
      false,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "decoder.block.3.layer.1.EncDecAttention.o.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "decoder.block.3.layer.1.EncDecAttention.q.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "decoder.block.3.layer.1.EncDecAttention.v.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "decoder.block.3.layer.2.DenseReluDense.wi.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "decoder.block.3.layer.2.DenseReluDense.wo.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "encoder.block.0.layer.0.SelfAttention.k.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "encoder.block.0.layer.0.SelfAttention.o.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "encoder.block.0.layer.0.SelfAttention.q.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "encoder.block.0.layer.0.SelfAttention.v.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "encoder.block.0.layer.1.DenseReluDense.wi.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "encoder.block.0.layer.1.DenseReluDense.wo.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "encoder.block.1.layer.0.SelfAttention.k.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "encoder.block.1.layer.0.SelfAttention.o.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "encoder.block.1.layer.0.SelfAttention.q.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "encoder.block.1.layer.0.SelfAttention.v.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "encoder.block.1.layer.1.DenseReluDense.wi.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "encoder.block.1.layer.1.DenseReluDense.wo.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "encoder.block.2.layer.0.SelfAttention.k.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "encoder.block.2.layer.0.SelfAttention.o.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "encoder.block.2.layer.0.SelfAttention.q.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "encoder.block.2.layer.0.SelfAttention.v.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "encoder.block.2.layer.1.DenseReluDense.wi.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "encoder.block.2.layer.1.DenseReluDense.wo.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "encoder.block.3.layer.0.SelfAttention.k.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "encoder.block.3.layer.0.SelfAttention.o.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "encoder.block.3.layer.0.SelfAttention.q.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "encoder.block.3.layer.0.SelfAttention.v.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "encoder.block.3.layer.1.DenseReluDense.wi.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "encoder.block.3.layer.1.DenseReluDense.wo.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "gate_mlp.0.lora_E": [
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false
    ],
    "gate_mlp.2.lora_E": [
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false
    ],
    "input_patch_embedding.hidden_layer.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "input_patch_embedding.output_layer.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "input_patch_embedding.residual_layer.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "output_patch_embedding.hidden_layer.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "output_patch_embedding.output_layer.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "output_patch_embedding.residual_layer.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "scale_mlp.0.lora_E": [
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false
    ],
    "scale_mlp.2.lora_E": [
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false
    ]
  },
  "revision": null,
  "target_modules": [
    "gate_mlp.0",
    "gate_mlp.2",
    "residual_layer",
    "o",
    "hidden_layer",
    "scale_mlp.0",
    "scale_mlp.2",
    "output_layer",
    "q",
    "wi",
    "v",
    "k",
    "wo"
  ],
  "target_parameters": null,
  "target_r": 8,
  "task_type": null,
  "tfinal": 700,
  "tinit": 100,
  "total_step": 1000,
  "trainable_token_indices": null,
  "use_dora": false,
  "use_qalora": false,
  "use_rslora": false
}